# DAP Mini Project

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# Importing the dataset
df = pd.read_csv('Suicides in India 2001-2012.csv')
df.head(10)

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
1,A & N Islands,2001,Causes,Bankruptcy or Sudden change in Economic,Female,0-14,0
2,A & N Islands,2001,Causes,Cancellation/Non-Settlement of Marriage,Female,0-14,0
3,A & N Islands,2001,Causes,Physical Abuse (Rape/Incest Etc.),Female,0-14,0
4,A & N Islands,2001,Causes,Dowry Dispute,Female,0-14,0
5,A & N Islands,2001,Causes,Family Problems,Female,0-14,0
6,A & N Islands,2001,Causes,Ideological Causes/Hero Worshipping,Female,0-14,0
7,A & N Islands,2001,Causes,Other Prolonged Illness,Female,0-14,0
8,A & N Islands,2001,Causes,Property Dispute,Female,0-14,0
9,A & N Islands,2001,Causes,Fall in Social Reputation,Female,0-14,0

In [4]:
# No of rows and columns
df.shape

(237519, 7)

Thus, the dataset contains 237519 rows and 7 columns

In [5]:
# Datatypes of the columns
df.dtypes

State        object
Year          int64
Type_code    object
Type         object
Gender       object
Age_group    object
Total         int64
dtype: object

In [6]:
# Names of the columns
df.columns

Index(['State', 'Year', 'Type_code', 'Type', 'Gender', 'Age_group', 'Total'], dtype='object')

In [7]:
# Info of the columns at a glance
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237519 entries, 0 to 237518
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   State      237519 non-null  object
 1   Year       237519 non-null  int64
 2   Type_code  237519 non-null  object
 3   Type       237519 non-null  object
 4   Gender     237519 non-null  object
 5   Age_group  237519 non-null  object
 6   Total      237519 non-null  int64
dtypes: int64(2), object(5)
memory usage: 12.7+ MB

In [8]:
# Various statistics about the numerical columns in the dataset
df.describe()

                Year          Total
count  237519.000000  237519.000000
mean     2006.500448      55.034477
std         3.452240     792.749038
min      2001.000000       0.000000
25%      2004.000000       0.000000
50%      2007.000000       0.000000
75%      2010.000000       6.000000
max      2012.000000   63343.000000

## Data Cleaning

In [10]:
# checking no of rows and columns in the dataset before cleaning
df.shape

(237519, 7)

In [11]:
# Checking for null values
df.isnull()

        State   Year  Type_code   Type  Gender  Age_group  Total
0       False  False      False  False   False      False  False
1       False  False      False  False   False      False  False
2       False  False      False  False   False      False  False
3       False  False      False  False   False      False  False
4       False  False      False  False   False      False  False
...       ...    ...        ...    ...     ...        ...    ...
237514  False  False      False  False   False      False  False
237515  False  False      False  False   False      False  False
237516  False  False      False  False   False      False  False
237517  False  False      False  False   False      False  False
237518  False  False      False  False   False      False  False

[237519 rows x 7 columns]

In [13]:
# total no of null values per row
df.isnull().sum()

State        0
Year         0
Type_code    0
Type         0
Gender       0
Age_group    0
Total        0
dtype: int64

In [15]:
# Total no of null values in the entire dataset
df.isnull().sum().sum()

0

Thus, there are no null values in the dataset

In [17]:
# Checking for duplicate values
df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
237514    False
237515    False
237516    False
237517    False
237518    False
Length: 237519, dtype: bool

In [18]:
# Dropping any duplicate values
df.drop_duplicates()

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
1,A & N Islands,2001,Causes,Bankruptcy or Sudden change in Economic,Female,0-14,0
2,A & N Islands,2001,Causes,Cancellation/Non-Settlement of Marriage,Female,0-14,0
3,A & N Islands,2001,Causes,Physical Abuse (Rape/Incest Etc.),Female,0-14,0
4,A & N Islands,2001,Causes,Dowry Dispute,Female,0-14,0
...,...,...,...,...,...,...,...
237514,West Bengal,2012,Social_Status,Seperated,Male,0-100+,149
237515,West Bengal,2012,Social_Status,Widowed/Widower,Male,0-100+,233
237516,West Bengal,2012,Social_Status,Married,Male,0-100+,5451
237517,West Bengal,2012,Social_Status,Divorcee,Male,0-100+,189
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

In [19]:
# Checking no of rows and columns in the dataset after cleaning
df.shape

(237519, 7)